# 03.09 - Pivot Tables

The **pivot table** takes simple column-wise data as input, and groups the entries into a two-dimensional table that provides a multidimensional summarization of the data.

### Motivating Pivot Tables

The examples in this section will use the database of passengers on the Titanic, available on Seaborn:

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [2]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Pivot Tables by Hand

We can start to learn about the data by applying simple <code>GroupBy</code> operations, as we learned before:

In [3]:
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

This is useful but limited information. We may want to go further and have a look at _multiple_ groups _simultaneously_:

In [4]:
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

Since this type of operation is quite common, Pandas introduced <code>pivot_table</code> to handle multi-dimensional aggregation.

### Pivot Table Syntax

Here is the equivalent syntax for what we did above using <code>pivot_table</code>:

In [5]:
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

### Multi-level pivot tables

Just as in the GroupBy, the grouping in pivot tables can be specified with multiple levels, and via a number of options.

For example, we may be interested in looking at age, that here we will bin using <code>pd.cut</code>:

In [8]:
age = pd.cut(titanic['age'], [0, 18, 50, 80])
titanic.pivot_table('survived', ['sex', age], 'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 50]  0.967213  0.912281  0.413793
       (50, 80]  1.000000  0.666667  1.000000
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 50]  0.442857  0.069444  0.139896
       (50, 80]  0.192308  0.083333  0.000000

We can add the same information on the columns as well:

In [9]:
fare = pd.qcut(titanic['fare'], 2)
titanic.pivot_table('survived', ['sex', age], [fare, 'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 50]              NaN  0.916667  0.428571          0.967213
       (50, 80]              NaN  0.000000  1.000000          1.000000
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 50]              0.0  0.095238  0.131737          0.469697
       (50, 80]              NaN  0.111111  0.000000          0.192308

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 50]  0.909091  0.391304
       (50, 80]  1.000000       NaN
male   (0, 18]   0.818182  0.178571
       (18, 50]  0.033333  0.192308
       (50, 80]  0.000000       NaN